package hw3;

/**
 * Created by Администратор on 11.10.2015.
 */
public class Hw2 {
    public static void main(String[] args){

        /**Задание 2
         Используя IntelliJ IDEA, создайте класс arithmeticAverage .
         Вычислите среднее арифметическое трех целочисленных значений и выведите его на экран.
         С какой проблемой вы столкнулись? Какой тип переменных лучше использовать для корректного отображения результата?
         */

        int a = 10;
        int b = 12;
        int c = 15;
        double midle = (double)(a + b + c) / 3;
        System.out.println(midle);



    }
}
