package hw3;

public class Hw3 {
    public static void main(String[] args) {

 /**Задание 3
  Используя IntelliJ IDEA, создайте класс circle.
  Создайте константу с именем PI (число π «пи»), создайте переменную радиус с именем – r.
  Используя формулу πR2, вычислите площадь круга и выведите результат на экран.
*/
        double pi = 3.14;
        int r = 34;
        double r2 = Math.pow(r,2);
        double area =  pi * r2;

        System.out.println(area);





  }
}
