package hw3;
/**
 * Задание 6
 В три переменные a, b и c записаны три вещественных числа. Создать программу, которая будет находить и выводить на экран
 вещественные корни квадратного уравнения ax²+bx+c=0, либо сообщать, что корней нет.
 */

public class Hw9 {
    public static void main(String[] args) {
       // sout = System.out.println();
 //       psvm = public static void main(String[] args) {

        

    }
}
