package AbstractHandler;
    /**
    *Задание 2
    *Используя IntelliJ IDEA, создайте проект.Требуется:
    *Создайте класс AbstractHandler.
    *В теле класса создать методы void Open(), void Create(), void Change(), void Save().
    *Создать производные классы XMLHandler, TXTHandler, DOCHandler от базового класса AbstractHandler.
    *Написать программу, которая будет выполнять определение документа и для каждого формата должны
    *быть методы открытия, создания, редактирования, сохранения определенного формата документа.
    */
public class AbstractHandler {
        void open(){
            System.out.println();
        }
        void create(){
            System.out.println();
        }
        void change(){
            System.out.println();
        }
        void save(){
            System.out.println();
        }
}
