package hw3;

/**
 * Created by Оксана on 08.10.2015.
 *
 * Задание 7
 Используя IntelliJ IDEA, создайте класс Calculator.
 Напишите программу - консольный калькулятор.
 Создайте две переменные с именами operand1 и operand2. Задайте переменным некоторые произвольные значения. Предложите
 пользователю ввести знак арифметической операции. Примите значение введенное пользователем и поместите его в строковую
 переменную sign. Для организации выбора алгоритма вычислительного процесса, используйте переключатель switch. Выведите
 на экран результат выполнения арифметической операции. В случае использования операции деления, организуйте проверку
 попытки деления на ноль. И если таковая имеется, то отмените выполнение арифметической операции и уведомите об ошибке
 пользователя.
 */
public class SeventhTask {
    public static void main(String[] args) {

    }
}
