package hw4;

/**
 * Created by ppota on 10/11/2015.
 */
//3. Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75 70 65 60 ….
public class task3 {
        public static void main(String[] args) {
            {
                for (int i = 90; i >= -95;i=i-5) {
                        System.out.println(i);

                }
            }
        }
    }