package hw4;

/**
 * Created by ppota on 10/11/2015.
 */
//2. Создайте программу, выводящую на экран первые 55 элементов последовательности 1 3 5 7 9 11 13 15 17 ….
public class task2 {
    public static void main(String[] args) {
        {
            for (int i = 1; i <= 55;i++) {
                if ((i % 2) == 0) ;
                    else
                    System.out.println(i);

            }
        }
    }
}

