package hw4;
/**
 * -------------------------------------------------- Последовательности --------------------------------------------------
 *1. Создайте программу, выводящую на экран все четырёхзначные числа последовательности 1000 1003 1006 1009 1012 1015 ….
 *2. Создайте программу, выводящую на экран первые 55 элементов последовательности 1 3 5 7 9 11 13 15 17 ….
 *3. Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75 70 65 60 ….
 *4. Создайте программу, выводящую на экран первые 20 элементов последовательности 2 4 8 16 32 64 128 ….
 *5. Выведите на экран первые 20 членов последовательности Фибоначчи.
 *------------------------------------------------------------------------------------------------------------------------
 */
public class Hw1 {
    public static void main(String[] args) {

        System.out.println("Task 1");

        int a = 1000;
        while (a < 10000) {
            System.out.println("a = " + a);
            a = a + 3;
        }

        System.out.println("Task 2");

        int b = 1, c = 1;

        while (b <= 55) {
            System.out.println(b + " - " + c);
            b++;
            c += 2;
        }

        System.out.println("Task 3");

        b = 90;

        while (b >= 0) {
            System.out.println("b = " + b);
            b -= 5;
        }

        System.out.println("Task 4");

        a = 2;
        b = 1;

        while (b <= 20) {
            System.out.println(b + " - " + a);
            a *= 2;
            b++;
        }

        System.out.println("Task 5");

        int n = 20,f = 1, d = 1;

        System.out.print(f + " " + d);

        int fib = 2, i = 2;

        while (i < n) {
            fib = f + d;
            f = d;
            d = fib;
            System.out.print(" " + fib);
            i++;
        }
    }
}
